<a href="https://colab.research.google.com/github/shant-kolekar/dataAnalyticsEssentialModules/blob/main/sql.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Resources
* Go to Resource: https://www.sqltutorial.org/sql-functions/
* Another: https://www.w3schools.com/sqL/sql_ref_sqlserver.asp

# DateTime Funcitons

## CAST

**Description**:  
Convert or change data type of an expression.

**Syntax**:  
`CAST(expression AS data_type)`

**Parameters**:
- `expression`:  
  - **Type**: Any data type  
  - **Description**: The value to be converted.
  
- `data_type`:  
  - **Type**: Data type  
  - **Description**: The target data type.

**List of Data Types**:
- `date`
- `datetime`
- `time`
- `float`
- `int`
- `decimal`

**Example**:
```sql
SELECT CAST(column_name AS INT) AS NewColumn
FROM table_name;
```

## FORMAT


**Description**:  
Change date/currency to the desired format.

**Syntax**:  
`FORMAT(expression, format_type, culture)`

**Parameters**:
- `expression`:  
  - **Type**: Any data type  
  - **Description**: The value to be formatted.
  
- `format_type`:  
  - **Type**: String  
  - **Description**: Format specifier for numeric or datetime formats.
  
- `culture`:  
  - **Type**: String  
  - **Description**: Optional. Culture code for locale-specific formatting (e.g., 'en-US').

---

### Numeric Format Example:
```sql
SELECT TOP (5) CurrencyRateID,
       EndOfDayRate,
       FORMAT(EndOfDayRate, 'N', 'en-us') AS 'Numeric Format',
       FORMAT(EndOfDayRate, 'G', 'en-us') AS 'General Format',
       FORMAT(EndOfDayRate, 'C', 'en-us') AS 'Currency Format'
FROM Sales.CurrencyRate
ORDER BY CurrencyRateID;

```

| CurrencyRateID | EndOfDayRate | Numeric Format | General Format | Currency Format |
|----------------|--------------|----------------|----------------|-----------------|
| 1              | 1.0002       | 1.00           | 1.0002         | $1.00           |
| 2              | 1.55         | 1.55           | 1.5500         | $1.55           |
| 3              | 1.9419       | 1.94           | 1.9419         | $1.94           |
| 4              | 1.4683       | 1.47           | 1.4683         | $1.47           |
| 5              | 8.2784       | 8.28           | 8.2784         | $8.28           |

## Datetime Format Example:



### Format Specifiers:

| Format Specifier | Description                                  | Example                              |
|------------------|----------------------------------------------|--------------------------------------|
| `dd`             | The day of the month, from 01 to 31.         | `'2009-06-15T13:45:30'` -> `'15'`    |
| `HH`             | The hour, using a 24-hour clock from 00 to 23.| `'2009-06-15T13:45:30'` -> `'13'`    |
| `mm`             | The minute, from 00 to 59.                   | `'2009-06-15T01:45:30'` -> `'45'`    |
| `MM`             | The month, from 01 to 12.                    | `'2009-06-15T13:45:30'` -> `'06'`    |
| `MMMM`           | The full name of the month.                  | `'2009-06-15T13:45:30'` -> `'June'`  |
| `ss`             | The second, from 00 to 59.                   | `'2009-06-15T13:45:30'` -> `'09'`    |
| `yyyy`           | The year as a four-digit number.             | `'2009-06-15T13:45:30'` -> `'2009'`  |


---

### Datetime Format Example Query:

```sql
SELECT
    FORMAT(GETDATE(), 'dd-MM-yyyy') AS 'Formatted Date',
    FORMAT(GETDATE(), 'HH:mm:ss') AS 'Formatted Time';

```
| Formatted Date | Formatted Time |
|----------------|----------------|
| 07-10-2024     | 13:45:30       |

# Window Functions

* Well Explalined here : https://www.sqltutorial.org/sql-window-functions/

# VIEWS

### SQL Views
A view is a virtual table generated by executing a query in a relational database, It doens't exits in database. The RDBMS stores the view as a named SELECT statement, and whenever you reference the view, the query is executed to produce the data.

### Why Use Views
- **Simplify Complex Queries**: Store complex queries as a view and access data with a simple SELECT statement.
- **Data Security**: Restrict access to specific columns, and only necessary data by allowing users to interact only with the view, instead of entire database/table.
- **Data Packaging**: Create custom data views for different user groups, e.g., showing only salary data to the Finance department.

### Creating Views
```sql
CREATE VIEW view_name AS
SELECT column_list FROM table_name;
```
>For example:
```sql
CREATE VIEW employee_contacts AS
    SELECT first_name, last_name, email, phone_number, department_name
    FROM employees e
    INNER JOIN departments d ON d.department_id = e.department_id
    ORDER BY first_name;
```
>You can rename columns in a view by specifying new column names after the `CREATE VIEW` clause:, If column names are not specified then names of base table columns are selected.
```sql
CREATE VIEW payroll (first_name, last_name, job, compensation) AS
    SELECT first_name, last_name, job_title, salary
    FROM employees e
    INNER JOIN jobs j ON j.job_id = e.job_id
    ORDER BY first_name;
```

### Querying Data from Views
>Querying data from views is similar to querying from tables:
```sql
SELECT * FROM employee_contacts;
```
>You can also filter, group, and aggregate data from views:
```sql
SELECT job, MIN(compensation), MAX(compensation), AVG(compensation)
FROM payroll
WHERE job LIKE 'A%'
GROUP BY job;
```

### Modifying Views
To modify a view, use `CREATE OR REPLACE VIEW`:

The statement creates a view if it does not exist or change the current view if the view already exists.


```sql
CREATE OR REPLACE VIEW view_name AS
SELECT column_list FROM table_name;
```
>Example:
```sql
CREATE OR REPLACE VIEW payroll (first_name, last_name, job, department, salary) AS
    SELECT first_name, last_name, job_title, department_name, salary
    FROM employees e
    INNER JOIN jobs j ON j.job_id = e.job_id
    INNER JOIN departments d ON d.department_id = e.department_id
    ORDER BY first_name;
```

### Removing Views
To remove a view from the database, The DROP VIEW statement deletes the view only, not the base tables.


```sql
DROP VIEW view_name;
```
>For example:
```sql
DROP VIEW payroll;
```